# #元组的基本操作 - turple ---> 元素可以重复，有序，不可修改
# #定义
# t1 =(13,343,123,45,12,65,22,12)
#
# print(t1)
# print(type(t1))#数据类型为元组turple
#
# #索引访问
# print(t1[0])
# print(t1[1])
#
# #切片
# print(t1[0:8:1])
# print(t1[::-1])
#
# #统计元素的个数
# print(t1.count(12))
# #获取元素第一个匹配到的索引 值
# print(t1.index(12))
# #定义单元素的元组，单个元素之后需要加上逗号，
# t2 = (10,)
# print(t2)
# print(type(t2))

# #组包 将多个值合并到一个容器（元组，列表）中
# t1 = (1,2,3,0)
# t2 = 4,5,6,7
#
# #解包 将容器（元组、列表）解开成独立的元素，分别赋值给多个变量
# #*号表示收集剩余的所有元素，允许我们处理不确定数量的元素，封装到列表当中
# a,b,c,d=t1#变量数量与容器的元素数量要一致
# print(a,b,c,d)#a=1,b=2,c=3,d=0
#
# x,*y,z = t2#x=4,*y=5,6,z=7
# print(x,y,z)
# *x,y = t2
# print(x,y)#*x=4,5,6 y=7
# x,*y = t2
# print(x,y)#x=4,*y=567
